In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql='''SELECT * FROM v_height177 ;'''

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0    1     2   3     4        5    6           7
0  KKH  김경호  1971  전남   019  3333333  177  2007-07-07
1  LJB  임재범  1963  서울   016  6666666  182  2009-09-09
2  LSG  이승기  1987  서울   011  1111111  182  2008-08-08
3  SSK  성시경  1979  서울  None     None  186  2013-12-12